In [1]:
import pandas as pd
import numpy as np

### Data frames

In [2]:
data = [
    ['Nissan', 'Stanza', 1991, 138, 4, 'MANUAL', 'sedan', 2000],
    ['Hyundai', 'Sonata', 2017, None, 4, 'AUTOMATIC', 'Sedan', 27150],
    ['Lotus', 'Elise', 2010, 218, 4, 'MANUAL', 'convertible', 54990],
    ['GMC', 'Acadia',  2017, 194, 4, 'AUTOMATIC', '4dr SUV', 34450],
    ['Nissan', 'Frontier', 2017, 261, 6, 'MANUAL', 'Pickup', 32340],
]

columns = [
    'Make', 'Model', 'Year', 'Engine HP', 'Engine Cylinders',
    'Transmission Type', 'Vehicle_Style', 'MSRP'
]

In [3]:
df = pd.DataFrame(data, columns=columns)
df

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP
0,Nissan,Stanza,1991,138.0,4,MANUAL,sedan,2000
1,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,Sedan,27150
2,Lotus,Elise,2010,218.0,4,MANUAL,convertible,54990
3,GMC,Acadia,2017,194.0,4,AUTOMATIC,4dr SUV,34450
4,Nissan,Frontier,2017,261.0,6,MANUAL,Pickup,32340

In [4]:
df.head(n=2)

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP
0,Nissan,Stanza,1991,138.0,4,MANUAL,sedan,2000
1,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,Sedan,27150

### Series

In [5]:
df.Make

0     Nissan
1    Hyundai
2      Lotus
3        GMC
4     Nissan
Name: Make, dtype: object

In [6]:
df['Engine HP']

0    138.0
1      NaN
2    218.0
3    194.0
4    261.0
Name: Engine HP, dtype: float64

In [7]:
df[['Make', 'Model', 'MSRP']]

      Make     Model   MSRP
0   Nissan    Stanza   2000
1  Hyundai    Sonata  27150
2    Lotus     Elise  54990
3      GMC    Acadia  34450
4   Nissan  Frontier  32340

In [8]:
df['id'] = ['nis1', 'hyu1', 'lot2', 'gmc1', 'nis2']
df

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP,id
0,Nissan,Stanza,1991,138.0,4,MANUAL,sedan,2000,nis1
1,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,Sedan,27150,hyu1
2,Lotus,Elise,2010,218.0,4,MANUAL,convertible,54990,lot2
3,GMC,Acadia,2017,194.0,4,AUTOMATIC,4dr SUV,34450,gmc1
4,Nissan,Frontier,2017,261.0,6,MANUAL,Pickup,32340,nis2

In [9]:
del df['id']
df

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP
0,Nissan,Stanza,1991,138.0,4,MANUAL,sedan,2000
1,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,Sedan,27150
2,Lotus,Elise,2010,218.0,4,MANUAL,convertible,54990
3,GMC,Acadia,2017,194.0,4,AUTOMATIC,4dr SUV,34450
4,Nissan,Frontier,2017,261.0,6,MANUAL,Pickup,32340

### Index

In [10]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [11]:
df.Year.index

RangeIndex(start=0, stop=5, step=1)

In [12]:
df.columns

Index(['Make', 'Model', 'Year', 'Engine HP', 'Engine Cylinders',
       'Transmission Type', 'Vehicle_Style', 'MSRP'],
      dtype='object')

In [13]:
df.iloc[0]

Make                 Nissan
Model                Stanza
Year                   1991
Engine HP             138.0
Engine Cylinders          4
Transmission Type    MANUAL
Vehicle_Style         sedan
MSRP                   2000
Name: 0, dtype: object

In [14]:
df.iloc[[2, 3, 0]]

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP
2,Lotus,Elise,2010,218.0,4,MANUAL,convertible,54990
3,GMC,Acadia,2017,194.0,4,AUTOMATIC,4dr SUV,34450
0,Nissan,Stanza,1991,138.0,4,MANUAL,sedan,2000

In [15]:
np.random.seed(2)
idx = np.arange(5)
np.random.shuffle(idx)
idx

array([2, 4, 1, 3, 0])

In [16]:
df.iloc[idx]

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP
2,Lotus,Elise,2010,218.0,4,MANUAL,convertible,54990
4,Nissan,Frontier,2017,261.0,6,MANUAL,Pickup,32340
1,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,Sedan,27150
3,GMC,Acadia,2017,194.0,4,AUTOMATIC,4dr SUV,34450
0,Nissan,Stanza,1991,138.0,4,MANUAL,sedan,2000

In [17]:
df = df.iloc[idx]
df

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP
2,Lotus,Elise,2010,218.0,4,MANUAL,convertible,54990
4,Nissan,Frontier,2017,261.0,6,MANUAL,Pickup,32340
1,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,Sedan,27150
3,GMC,Acadia,2017,194.0,4,AUTOMATIC,4dr SUV,34450
0,Nissan,Stanza,1991,138.0,4,MANUAL,sedan,2000

In [18]:
df.iloc[[0, 1, 2]]

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP
2,Lotus,Elise,2010,218.0,4,MANUAL,convertible,54990
4,Nissan,Frontier,2017,261.0,6,MANUAL,Pickup,32340
1,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,Sedan,27150

In [19]:
df.index

Index([2, 4, 1, 3, 0], dtype='int64')

In [20]:
df.loc[[0, 1]]

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP
0,Nissan,Stanza,1991,138.0,4,MANUAL,sedan,2000
1,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,Sedan,27150

In [21]:
df = df.reset_index(drop=True)
df

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP
0,Lotus,Elise,2010,218.0,4,MANUAL,convertible,54990
1,Nissan,Frontier,2017,261.0,6,MANUAL,Pickup,32340
2,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,Sedan,27150
3,GMC,Acadia,2017,194.0,4,AUTOMATIC,4dr SUV,34450
4,Nissan,Stanza,1991,138.0,4,MANUAL,sedan,2000

In [22]:
df.iloc[:3]

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP
0,Lotus,Elise,2010,218.0,4,MANUAL,convertible,54990
1,Nissan,Frontier,2017,261.0,6,MANUAL,Pickup,32340
2,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,Sedan,27150

### Element-Wise Operations

In [23]:
df['Engine HP']

0    218.0
1    261.0
2      NaN
3    194.0
4    138.0
Name: Engine HP, dtype: float64

In [24]:
df['Engine HP'] * 2

0    436.0
1    522.0
2      NaN
3    388.0
4    276.0
Name: Engine HP, dtype: float64

In [25]:
df['Year']

0    2010
1    2017
2    2017
3    2017
4    1991
Name: Year, dtype: int64

In [26]:
df['Year'] > 2000

0     True
1     True
2     True
3     True
4    False
Name: Year, dtype: bool

In [27]:
(df['Year'] > 2000) & (df['Make'] == 'Nissan')

0    False
1     True
2    False
3    False
4    False
dtype: bool

In [28]:
df[df['Make'] == 'Nissan']

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP
1,Nissan,Frontier,2017,261.0,6,MANUAL,Pickup,32340
4,Nissan,Stanza,1991,138.0,4,MANUAL,sedan,2000

In [29]:
df[(df['Year'] > 2010) & (df['Transmission Type'] == 'AUTOMATIC')]

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP
2,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,Sedan,27150
3,GMC,Acadia,2017,194.0,4,AUTOMATIC,4dr SUV,34450

### String Operations

In [30]:
df['Vehicle_Style']

0    convertible
1         Pickup
2          Sedan
3        4dr SUV
4          sedan
Name: Vehicle_Style, dtype: object

In [31]:
df["Vehicle_Style"].str.lower()

0    convertible
1         pickup
2          sedan
3        4dr suv
4          sedan
Name: Vehicle_Style, dtype: object

In [32]:
df['Vehicle_Style'].str.replace(' ', '_')

0    convertible
1         Pickup
2          Sedan
3        4dr_SUV
4          sedan
Name: Vehicle_Style, dtype: object

In [33]:
df["Vehicle_Style"].str.lower().str.replace(' ', '_')

0    convertible
1         pickup
2          sedan
3        4dr_suv
4          sedan
Name: Vehicle_Style, dtype: object

In [34]:
df.columns.str.lower().str.replace(' ', '_')

Index(['make', 'model', 'year', 'engine_hp', 'engine_cylinders',
       'transmission_type', 'vehicle_style', 'msrp'],
      dtype='object')

In [35]:
df.columns = df.columns.str.lower().str.replace(' ', '_')
df

,make,model,year,engine_hp,engine_cylinders,transmission_type,vehicle_style,msrp
0,Lotus,Elise,2010,218.0,4,MANUAL,convertible,54990
1,Nissan,Frontier,2017,261.0,6,MANUAL,Pickup,32340
2,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,Sedan,27150
3,GMC,Acadia,2017,194.0,4,AUTOMATIC,4dr SUV,34450
4,Nissan,Stanza,1991,138.0,4,MANUAL,sedan,2000

In [36]:
df.dtypes

make                  object
model                 object
year                   int64
engine_hp            float64
engine_cylinders       int64
transmission_type     object
vehicle_style         object
msrp                   int64
dtype: object

In [37]:
df.dtypes.index

Index(['make', 'model', 'year', 'engine_hp', 'engine_cylinders',
       'transmission_type', 'vehicle_style', 'msrp'],
      dtype='object')

In [38]:
df.dtypes[df.dtypes == 'object']

make                 object
model                object
transmission_type    object
vehicle_style        object
dtype: object

In [39]:
df.dtypes[df.dtypes == 'object'].index

Index(['make', 'model', 'transmission_type', 'vehicle_style'], dtype='object')

In [40]:
list(df.dtypes[df.dtypes == 'object'].index)

['make', 'model', 'transmission_type', 'vehicle_style']

In [41]:
string_col = df.dtypes[df.dtypes == 'object'].index

for col in string_col:
    df[col] = df[col].str.lower().str.replace(" ", "_")

df

,make,model,year,engine_hp,engine_cylinders,transmission_type,vehicle_style,msrp
0,lotus,elise,2010,218.0,4,manual,convertible,54990
1,nissan,frontier,2017,261.0,6,manual,pickup,32340
2,hyundai,sonata,2017,NaN,4,automatic,sedan,27150
3,gmc,acadia,2017,194.0,4,automatic,4dr_suv,34450
4,nissan,stanza,1991,138.0,4,manual,sedan,2000

### Summarizing operations

In [42]:
df.msrp.min()

2000

In [43]:
df.msrp.max()

54990

In [44]:
df.msrp.mean()

np.float64(30186.0)

In [45]:
df.msrp.describe()

count        5.000000
mean     30186.000000
std      18985.044904
min       2000.000000
25%      27150.000000
50%      32340.000000
75%      34450.000000
max      54990.000000
Name: msrp, dtype: float64

In [46]:
df.msrp.describe().round(2)

count        5.00
mean     30186.00
std      18985.04
min       2000.00
25%      27150.00
50%      32340.00
75%      34450.00
max      54990.00
Name: msrp, dtype: float64

In [47]:
df.make.nunique()

4

In [48]:
df.nunique()

make                 4
model                5
year                 3
engine_hp            4
engine_cylinders     2
transmission_type    2
vehicle_style        4
msrp                 5
dtype: int64

In [49]:
df.make.value_counts()

make
nissan     2
lotus      1
hyundai    1
gmc        1
Name: count, dtype: int64

In [50]:
df.isnull()

,make,model,year,engine_hp,engine_cylinders,transmission_type,vehicle_style,msrp
0,False,False,False,False,False,False,False,False
1,False,False,False,False,False,False,False,False
2,False,False,False,True,False,False,False,False
3,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False

In [51]:
df.isnull().sum()

make                 0
model                0
year                 0
engine_hp            1
engine_cylinders     0
transmission_type    0
vehicle_style        0
msrp                 0
dtype: int64

In [52]:
df.engine_hp.fillna(0)

0    218.0
1    261.0
2      0.0
3    194.0
4    138.0
Name: engine_hp, dtype: float64

In [53]:
df.engine_hp.fillna(df.engine_hp.mean())

0    218.00
1    261.00
2    202.75
3    194.00
4    138.00
Name: engine_hp, dtype: float64

In [54]:
df.engine_hp = df.engine_hp.fillna(df.engine_hp.mean())
df

,make,model,year,engine_hp,engine_cylinders,transmission_type,vehicle_style,msrp
0,lotus,elise,2010,218.00,4,manual,convertible,54990
1,nissan,frontier,2017,261.00,6,manual,pickup,32340
2,hyundai,sonata,2017,202.75,4,automatic,sedan,27150
3,gmc,acadia,2017,194.00,4,automatic,4dr_suv,34450
4,nissan,stanza,1991,138.00,4,manual,sedan,2000

### Sorting & Re-ordering

In [55]:
df

,make,model,year,engine_hp,engine_cylinders,transmission_type,vehicle_style,msrp
0,lotus,elise,2010,218.00,4,manual,convertible,54990
1,nissan,frontier,2017,261.00,6,manual,pickup,32340
2,hyundai,sonata,2017,202.75,4,automatic,sedan,27150
3,gmc,acadia,2017,194.00,4,automatic,4dr_suv,34450
4,nissan,stanza,1991,138.00,4,manual,sedan,2000

In [56]:
df.sort_values(by='msrp')

,make,model,year,engine_hp,engine_cylinders,transmission_type,vehicle_style,msrp
4,nissan,stanza,1991,138.00,4,manual,sedan,2000
2,hyundai,sonata,2017,202.75,4,automatic,sedan,27150
1,nissan,frontier,2017,261.00,6,manual,pickup,32340
3,gmc,acadia,2017,194.00,4,automatic,4dr_suv,34450
0,lotus,elise,2010,218.00,4,manual,convertible,54990

In [58]:
df.sort_values(by='msrp', ascending=False)

,make,model,year,engine_hp,engine_cylinders,transmission_type,vehicle_style,msrp
0,lotus,elise,2010,218.00,4,manual,convertible,54990
3,gmc,acadia,2017,194.00,4,automatic,4dr_suv,34450
1,nissan,frontier,2017,261.00,6,manual,pickup,32340
2,hyundai,sonata,2017,202.75,4,automatic,sedan,27150
4,nissan,stanza,1991,138.00,4,manual,sedan,2000

### Grouping

SELECT
    tranmission_type,
    AVG(msrp)
FROM
    cars
GROUP BY
    transmission_type

In [60]:
df.groupby('transmission_type').msrp.mean()

transmission_type
automatic    30800.000000
manual       29776.666667
Name: msrp, dtype: float64

SELECT
    tranmission_type,
    AVG(msrp),
    COUNT(msrp)
FROM
    cars
GROUP BY
    transmission_type

In [62]:
df_group = df.groupby('transmission_type').msrp.agg(['mean', 'count'])
df_group

                           mean  count
transmission_type
automatic          30800.000000      2
manual             29776.666667      3

In [64]:
df_group['mean'] - df.msrp.mean()

transmission_type
automatic    614.000000
manual      -409.333333
Name: mean, dtype: float64

### Conversion

NumPy Arrays

In [71]:
df.msrp.values

array([54990, 32340, 27150, 34450,  2000])

Dicts

In [77]:
df.to_dict(orient='records')

[{'make': 'lotus',
  'model': 'elise',
  'year': 2010,
  'engine_hp': 218.0,
  'engine_cylinders': 4,
  'transmission_type': 'manual',
  'vehicle_style': 'convertible',
  'msrp': 54990},
 {'make': 'nissan',
  'model': 'frontier',
  'year': 2017,
  'engine_hp': 261.0,
  'engine_cylinders': 6,
  'transmission_type': 'manual',
  'vehicle_style': 'pickup',
  'msrp': 32340},
 {'make': 'hyundai',
  'model': 'sonata',
  'year': 2017,
  'engine_hp': 202.75,
  'engine_cylinders': 4,
  'transmission_type': 'automatic',
  'vehicle_style': 'sedan',
  'msrp': 27150},
 {'make': 'gmc',
  'model': 'acadia',
  'year': 2017,
  'engine_hp': 194.0,
  'engine_cylinders': 4,
  'transmission_type': 'automatic',
  'vehicle_style': '4dr_suv',
  'msrp': 34450},
 {'make': 'nissan',
  'model': 'stanza',
  'year': 1991,
  'engine_hp': 138.0,
  'engine_cylinders': 4,
  'transmission_type': 'manual',
  'vehicle_style': 'sedan',
  'msrp': 2000}]